backend/app/controllers/hand_range_groups_controller.rb

    def index
      @hand_range_groups = HandRangeGroup.all
---
SELECT `hand_range_groups`.* FROM `hand_range_groups`