backend/app/controllers/hand_range_folders_controller.rb

    def index
      @hand_range_folders = HandRangeFolder.all
---
SELECT `hand_range_folders`.* FROM `hand_range_folders` WHERE (user_id = 2)

    def create
      @hand_range_folder = HandRangeFolder.new(FolderName: params[:FolderName], user_id: params[:user_id])
      if @hand_range_folder.save
---
INSERT INTO `hand_range_folders` (`FolderName`, `user_id`) VALUES ('NewestHandRange', 1)

    def update
      if @hand_range_folder.update(hand_range_params)
---
UPDATE `hand_range_folders` SET `hand_range_folders`.`FolderName` = '1' WHERE `hand_range_folders`.`id` = 1

      def set_hand_range
        @hand_range_folder = HandRangeFolder.find(params[:id])
---
SELECT `hand_range_folders`.* FROM `hand_range_folders` WHERE `hand_range_folders`.`id` = 1 LIMIT 1