backend/app/controllers/hand_ranges_controller.rb

    @hand_range02 = HandRange.new(RangeName: 'CO', RangeScope: '')
    @hand_range02.save
    @hand_range03 = HandRange.new(RangeName: 'BU', RangeScope: '')
    @hand_range03.save
    @hand_range04 = HandRange.new(RangeName: 'SB', RangeScope: '')
    @hand_range04.save
---
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('BU', '', '2020-04-20 00:47:08.028679', '2020-04-20 00:47:08.028679')
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('SB', '', '2020-04-20 00:47:08.052043', '2020-04-20 00:47:08.052043')

    @hand_range_group03 = HandRangeGroup.new(GroupName: "Defending Ranges", hand_range_id: @hand_range03.id, hand_range_folder_id: @hand_range_folder.id)
    @hand_range_group04 = HandRangeGroup.new(GroupName: "Defending Ranges", hand_range_id: @hand_range04.id, hand_range_folder_id: @hand_range_folder.id)

    @hand_range_group00.save
    @hand_range_group01.save
    @hand_range_group02.save
    @hand_range_group03.save
    @hand_range_group04.save

    if @hand_range_group3.save

      @result_hand_ranges = HandRangeGroup.select("*").joins(:hand_range, :hand_range_folder).where(:hand_range_folders => { id: @hand_range_folder.id } )
---
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`, `hand_range_folder_id`) VALUES ('Defending Ranges', 118, 42)
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`, `hand_range_folder_id`) VALUES ('Defending Ranges', 119, 42)
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`, `hand_range_folder_id`) VALUES ('Defending Ranges', 120, 42)
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`, `hand_range_folder_id`) VALUES ('Defending Ranges', 121, 42)
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`, `hand_range_folder_id`) VALUES ('Defending Ranges', 122, 42)
SELECT * FROM `hand_range_groups` INNER JOIN `hand_ranges` ON `hand_ranges`.`id` = `hand_range_groups`.`hand_range_id` INNER JOIN `hand_range_folders` ON `hand_range_folders`.`id` = `hand_range_groups`.`hand_range_folder_id` WHERE `hand_range_group`.`hand_range_folder_id` = 43