backend/app/controllers/hand_ranges_controller.rb

  def index
    @hand_ranges = HandRange.all
---
SELECT `hand_ranges`.* FROM `hand_ranges`

  def show_user_id
    @hand_range = HandRangeGroup.select("*").joins(:hand_range, :hand_range_folder)
    .where("hand_range_groups.hand_range_folder_id = hand_range_folders.id AND hand_range_groups.hand_range_id = hand_ranges.id AND hand_range_folders.user_id = " + params[:user_id] )
---
SELECT * FROM `hand_range_groups` INNER JOIN `hand_ranges` ON `hand_ranges`.`id` = `hand_range_groups`.`hand_range_id` INNER JOIN `hand_range_folders` ON `hand_range_folders`.`id` = `hand_range_groups`.`hand_range_folder_id` WHERE (hand_range_groups.hand_range_folder_id = hand_range_folders.id AND hand_range_groups.hand_range_id = hand_ranges.id)

  def create
    @hand_range0 = HandRange.new(RangeName: params[:RangeName], RangeScope: params[:RangeScope0])
    @hand_range0.save
    @hand_range1 = HandRange.new(RangeName: params[:RangeName], RangeScope: params[:RangeScope1])
    @hand_range1.save
    @hand_range2 = HandRange.new(RangeName: params[:RangeName], RangeScope: params[:RangeScope2])
    @hand_range2.save
    @hand_range3 = HandRange.new(RangeName: params[:RangeName], RangeScope: params[:RangeScope3])
    @hand_range3.save

    @hand_range_folder = HandRangeFolder.new(FolderName: "Evans Folder", user_id: params[:user_id])
    @hand_range_folder.save
    @hand_range_group0 = HandRangeGroup.new(GroupName: "First Hand Range Group", hand_range_id: @hand_range0.id, hand_range_folder_id: @hand_range_folder.id)
    @hand_range_group1 = HandRangeGroup.new(GroupName: "First Hand Range Group", hand_range_id: @hand_range1.id, hand_range_folder_id: @hand_range_folder.id)
    @hand_range_group2 = HandRangeGroup.new(GroupName: "First Hand Range Group", hand_range_id: @hand_range2.id, hand_range_folder_id: @hand_range_folder.id)
    @hand_range_group3 = HandRangeGroup.new(GroupName: "First Hand Range Group", hand_range_id: @hand_range3.id, hand_range_folder_id: @hand_range_folder.id)

    @hand_range_group0.save
    @hand_range_group1.save
    @hand_range_group2.save

    if @hand_range_group3.save

      @result_hand_ranges = HandRangeGroup.select("*").joins(:hand_range, :hand_range_folder).where(:hand_range_groups => { hand_range_id: @hand_range0.id} )
---
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('RangeName', 'RangeScope1', '2020-02-28 12:06:54.583520', '2020-02-28 12:06:54.583520')
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('RangeName', 'RangeScope2', '2020-02-28 12:06:54.586849', '2020-02-28 12:06:54.586849')
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('RangeName', 'RangeScope3', '2020-02-28 12:06:54.590120', '2020-02-28 12:06:54.590120')
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('RangeName', 'RangeScope4', '2020-02-28 12:06:54.593601', '2020-02-28 12:06:54.593601')
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('MP', '', '2020-04-20 00:47:06.233003', '2020-04-20 00:47:06.233003')
INSERT INTO `hand_range_folders` (`FolderName`, `user_id`) VALUES ('Evans Folder', 1)
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`) VALUES ('First Hand Range Group', 62)
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('SB', '', '2020-04-20 00:47:06.304805', '2020-04-20 00:47:06.304805')
INSERT INTO `hand_ranges` (`RangeName`, `RangeScope`, `created_at`, `updated_at`) VALUES ('UTG', '', '2020-04-20 00:47:07.941887', '2020-04-20 00:47:07.941887')
INSERT INTO `hand_range_groups` (`GroupName`, `hand_range_id`, `hand_range_folder_id`) VALUES ('Opening Ranges', 113, 42)
SELECT `hand_range_groups`.* FROM `hand_range_groups` INNER JOIN `hand_ranges` ON `hand_ranges`.`id` = `hand_range_groups`.`hand_range_id` INNER JOIN `hand_range_folders` ON `hand_range_folders`.`id` = `hand_range_groups`.`hand_range_folder_id` WHERE `hand_ranges`.`id` = 71 AND `hand_range_groups`.`hand_range_id` = 71

    def set_hand_range
      @hand_range = HandRange.find(params[:id])
---
SELECT `hand_ranges`.* FROM `hand_ranges` WHERE `hand_ranges`.`id` = 2 LIMIT 1