backend/app/controllers/public_controller.rb

INSERT INTO `hands` (`hand`, `created_at`, `updated_at`) VALUES ('handValue', '2020-10-03 13:24:08.842421', '2020-10-03 13:24:08.842421')
INSERT INTO `range_object_collections` (`Board`, `HandName`, `PokerUser`, `created_at`, `updated_at`) VALUES ('Ac,Ad,Ks', 'rangeRepoIP', 'Evan', '2020-10-04 00:12:47.386961', '2020-10-04 00:12:47.386961')
INSERT INTO `range_objects` (`Street`, `BetType`, `created_at`, `updated_at`) VALUES ('Preflop', 'Raise4BetCall', '2020-10-03 13:36:03.847134', '2020-10-03 13:36:03.847134')
INSERT INTO `hands` (`hand`, `created_at`, `updated_at`) VALUES ('Q9o', '2020-10-03 13:32:31.932937', '2020-10-03 13:32:31.932937')
INSERT INTO `range_objects` (`Street`, `BetType`, `PokerHands`, `created_at`, `updated_at`) VALUES ('Preflop', 'Raise4BetCall', '[]', '2020-10-05 18:30:53.108181', '2020-10-05 18:30:53.108181')
INSERT INTO `hands` (`hand`, `created_at`, `updated_at`) VALUES ('Q9o', '2020-10-03 13:51:07.462413', '2020-10-03 13:51:07.462413')
INSERT INTO `range_object_collections` (`Board`, `HandName`, `PokerUser`, `created_at`, `updated_at`) VALUES ('5d,7h,2s,5h,As', 'rangeRepoOOP', 'Evan', '2020-10-06 01:40:34.367988', '2020-10-06 01:40:34.367988')
INSERT INTO `range_objects` (`Street`, `BetType`, `PokerHands`, `created_at`, `updated_at`) VALUES ('Preflop', 'Raise4BetCall', '', '2020-10-06 01:40:34.370894', '2020-10-06 01:40:34.370894')
INSERT INTO `range_objects` (`Street`, `BetType`, `PokerHands`, `created_at`, `updated_at`) VALUES ('Preflop', 'Raise4BetCall', '', '2020-10-06 00:52:32.575287', '2020-10-06 00:52:32.575287')
INSERT INTO `range_object_collections` (`Board`, `HandName`, `PokerUser`, `created_at`, `updated_at`) VALUES ('Ac,Ad,Ks', 'rangeRepoOOP', 'Evan', '2020-10-04 00:12:47.822854', '2020-10-04 00:12:47.822854')
---
    def couchbase_insert()
      board = params[:deadcards]
      # user = params[:user]
      rangeRepoIP = params[:rangeRepoIP]
      rangeRepoOOP = params[:rangeRepoOOP]

      # Enable below in server
      # @auth_payload, @auth_header = request.headers['Authorization'].split(' ').last

      # responses, header = JsonWebToken.verify(@auth_payload)
      # user = responses['sub'].split('|')[1]
      user = 'Evan'

      @newRangeObjectCollection = RangeObjectCollection.new(Board: board, HandName: :rangeRepoIP, PokerUser: user)
      @newRangeObjectCollection.save

      for index in 0..rangeRepoIP.length() - 1 do
        @newRangeObject = RangeObject.new(Street: rangeRepoIP[index]['Street'], BetType: rangeRepoIP[index]['BetType'], PokerHands: "#{rangeRepoIP[index]['hands'].join(", ")}" || '')
        @newRangeObject.save
        @newRangeObjectMeta = RangeCollectionMetum.new(range_object_id: @newRangeObject.id, range_object_collection_id: @newRangeObjectCollection.id)
        @newRangeObjectMeta.save
      end

      @newRangeObjectCollection2 = RangeObjectCollection.new(Board: board, HandName: :rangeRepoOOP, PokerUser: user)
      @newRangeObjectCollection2.save

      for index in 0..rangeRepoOOP.length() - 1 do
        @newRangeObject2 = RangeObject.new(Street: rangeRepoOOP[index]['Street'], BetType: rangeRepoOOP[index]['BetType'], PokerHands: "#{rangeRepoOOP[index]['hands'].join(", ")}" || '')
        @newRangeObject2.save
        @newRangeObjectMeta2 = RangeCollectionMetum.new(range_object_id: @newRangeObject2.id, range_object_collection_id: @newRangeObjectCollection2.id)
        @newRangeObjectMeta2.save

SELECT DISTINCT `range_object_collections`.`Board` FROM `range_object_collections` WHERE (PokerUser = 'Evan')
---
    def get_all_scenario
      @userRangeCollection = RangeObjectCollection.where( "PokerUser = 'Evan'"  ).distinct.pluck(:Board)