backend/app/controllers/users_controller.rb

  def show
    user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]

  def create
    @user = User.new()
    @user.name = params[:name]
    @user.password = params[:password]
    @user.email = params[:email]

    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('thebestpokeruser', 'test@test.ca', '2020-02-28 00:22:11.816976', '2020-02-28 00:22:11.816976', '$2a$12$alxQFT5GgBJysdy2cjzCRu60/0yrQZythZF6h2Wo7bM5qJsVCzP3q')