app/controllers/application_controller.rb

    def session_user
        decoded_hash = decoded_token
        if !decoded_hash.empty?
            user_id = decoded_hash[0]['user_id']
            @user = User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1