app/controllers/auth_controller.rb

    def login
        @user = User.find_by(username: params[:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'evan' LIMIT 1