app/controllers/auth_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`name` = 'evan' LIMIT 1
---
    def login
        @user = User.find_by(name: params[:name])